<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'failed' => 'Ці дані не відповідають нашим записам.',
    'password' => 'Введений пароль неправильний.',
    'throttle' => 'Занадто багато спроб входу. Повторіть спробу через :seconds секунд.',
    "child_hint" => "
    <strong class='mb-0'>У кабінеті дитини можна:</strong>
    <ul class='list-unstyled'>
    <li>1. Проходити цікаві тести і тренажери. За правильні відповіді отримувати монети і пізнавальні картки.</li>
    <li>2. Зароблені монети батькам міняти на подарунки та кишенькові гроші.</li>
    <li>3. Заводити друзів, спілкуватися, брати участь в RoZoom-рингах.</li>
    <li>4. Отримувати гривні, запрошуючи нових користувачів, викладаючи авторські відео про RoZoom на Youtube.</li>
    </ul>
",
    "parent_hint" => "
    <strong class='mb-0'>У кабінеті батька можна:</strong>
    <ul class='list-unstyled'>
   <li>1. Створювати акаунти для своїх дітей і керувати налаштуваннями.</li>
   <li>2. Ставити цілі дитині, створювати міні-навчальні плани для дітей.</li>
   <li>3. Переглядати статистику проходження завдань і неправильних відповідей.</li>
   <li>4. Отримувати гривні, запрошуючи нових користувачів, викладаючи авторські відео про RoZoom на Youtube</li>
    </ul>
    ",
    "teacher_hint" => "
    <strong class='mb-0'>У кабінеті вчителя можна:</strong>
    <ul class='list-unstyled'>
   <li>1. Оформити резюме репетитора.</li>
   <li>2. Заробляти, створюючи нові завдання.</li>
   <li>3. Заробляти, проводячи онлайн-уроки.</li>
   <li>4. Заробляти, запрошуючи нових користувачів, викладаючи авторські відео про RoZoom на Youtube</li>
    </ul>
    "
];
