<?php
return [
	/*
	|--------------------------------------------------------------------------
	| Мовні ресурси для перевірки значень
	|--------------------------------------------------------------------------
	|
	| Наступні мовні рядки містять повідомлення за замовчуванням, які використовуються 
	| класом, що перевіряє значення (валідатором). Деякі з правил мають
	| декілька версій, наприклад, size. Ви маєте можливіть змінити їх на будь-які
	| інші, що ліпше підходять для Вашего додатку.
	|
	*/
	'accepted'             => 'Ви повинні прийняти :attribute.',
	'active_url'           => 'Поле :attribute містить недійсний URL.',
	'after'                => 'В полі :attribute повинна бути дата після :date.',
	'after_or_equal'       => 'В полі :attribute повинна бути дата після чи дорівнювати :date.',
	'alpha'                => 'Поле :attribute може містити тільки літери.',
	'alpha_dash'           => 'Поле :attribute може містити тільки літери, цифри, дефіс та нижнє підкреслення.',
	'alpha_num'            => 'Поле :attribute може містити тільки літери та цифри.',
	'array'                => 'Поле :attribute повинно бути масивом.',
	'before'               => 'В полі :attribute повинна бути дата до :date.',
	'before_or_equal'      => 'В полі :attribute повинна бути дата до чи дорівнювати :date.',
	'between'              => [
		'numeric' => 'Поле :attribute повинно бути між :min та :max.',
		'file'    => 'Розмір файлу в полі :attribute повинен бути між :min та :max Кілобайт(а).',
		'string'  => 'Кількість символів в полі :attribute повинна бути між :min та :max.',
		'array'   => 'Кількість елементів в полі :attribute повинна бути між :min та :max.',
	],
	'boolean'              => 'Поле :attribute повинно мати значення логічного типу.',
	'confirmed'            => 'Поле :attribute не співпадає з підтвердженням.',
	'date'                 => 'Поле :attribute не є датою.',
	'date_equals'          => 'Поле :attribute повинно бути датою, що дорівнює :date.',
	'date_format'          => 'Поле :attribute не відповідає формату :format.',
	'different'            => 'Поля :attribute та :other повинні відрізнятися.',
	'digits'               => 'Довжина цифрового поля :attribute повинна бути :digits.',
	'digits_between'       => 'Довжина цифрового поля :attribute повинна бути між :min та :max.',
	'dimensions'           => 'Поле :attribute имеет недопустимые размеры изображения.',
	'distinct'             => 'Поле :attribute містить повторюване значення.',
	'email'                => 'Поле :attribute повинно бути дійсною електронною адресою.',
    'ends_with'            => 'Поле :attribute повинно закінчуватися одним з наступних значень: :values.',
	'exists'               => 'Обране значення для :attribute некоректне.',
	'file'                 => 'Поле :attribute повинно бути файлом.',
	'filled'               => 'Поле :attribute обов\'язкове для заповнювання.',
	'gt'                   => [
		'numeric' => 'Поле :attribute повинно бути більше :value.',
		'file'    => 'Розмір файлу в полі :attribute повинен бути більше :value Кілобайт(а).',
		'string'  => 'Кількість символів в полі :attribute повинна бути більше :value.',
		'array'   => 'Кількість елементів в полі :attribute повинна бути більше :value.',
	],
	'gte'                  => [
		'numeric' => 'Поле :attribute повинно бути більше чи дорівнювати :value.',
		'file'    => 'Розмір файлу в полі :attribute повинен бути більше чи дорівнювати :value Кілобайт(а).',
		'string'  => 'Кількість символів в полі :attribute повинна бути більше чи дорівнювати :value.',
		'array'   => 'Кількість элементів в полі :attribute повинна бути більше чи дорювнювати :value.',
	],
	'image'                => 'Поле :attribute повинно бути зображенням.',
	'in'                   => 'Вибране значення для :attribute помилкове.',
	'in_array'             => 'Поля :attribute не існує в :other.',
	'integer'              => 'Поле :attribute повинно бути цілим числом.',
	'ip'                   => 'Поле :attribute повинно бути дійсною IP-адресою.',
	'ipv4'                 => 'Поле :attribute повинно бути дійсною IPv4-адресою.',
	'ipv6'                 => 'Поле :attribute повинно бути дійсною IPv6-адресою.',
	'json'                 => 'Поле :attribute повинно бути JSON рядком.',
	'lt'                   => [
		'numeric' => 'Поле :attribute повинно бути менше :value.',
		'file'    => 'Розмір файлу в полі :attribute повинен бути менше :value Кілобайт(а).',
		'string'  => 'Кількість символів в полі :attribute повинна бути менше :value.',
		'array'   => 'Кількість елементів в полі :attribute повинна бути менше :value.',
	],
	'lte'                  => [
		'numeric' => 'Поле :attribute повинно бути менше чи дорівнювати :value.',
		'file'    => 'Розмір файлу в полі :attribute повинен бути менше чи дорівнювати :value Кілобайт(а).',
		'string'  => 'Кількість символів в полі :attribute повинна бути менше чи дорівнювати :value.',
		'array'   => 'Кількість елементів в полі :attribute повинна бути менше чи дорівнювати :value.',
	],
	'max'                  => [
		'numeric' => 'Поле :attribute не може бути більше :max.',
		'file'    => 'Розмір файлу в полі :attribute не може бути більше :max Кілобайт(а).',
		'string'  => 'Кількість символів в полі :attribute не може перевищувати :max.',
		'array'   => 'Кількість елементів в полі :attribute не може перевищувати :max.',
	],
	'mimes'                => 'Поле :attribute повинно бути файлом одного з наступних типів: :values.',
	'mimetypes'            => 'Поле :attribute повинно бути файлом одного з наступних типів: :values.',
	'min'                  => [
		'numeric' => 'Поле :attribute повинно бути не менше :min.',
		'file'    => 'Розмір файлу в полі :attribute повинен бути не менше :min Кілобайт(а).',
		'string'  => 'Кількість символів в полі :attribute повинна бути не менше :min.',
		'array'   => 'Кількість елементів в полі :attribute повинна бути не менше :min.',
	],
    'multiple_of'          => 'Поле :attribute повинно бути кратним :value.',
	'not_in'               => 'Вибране значення для :attribute помилкове.',
	'not_regex'            => 'Вибраний формат для :attribute помилковий.',
	'numeric'              => 'Поле :attribute повинно бути числом.',
    'password'             => 'Пароль невірний.',
	'present'              => 'Поле :attribute повинно бути присутнім.',
	'regex'                => 'Поле :attribute має помилковий формат.',
	'required'             => 'Поле :attribute обов\'язкове для заповнювання.',
	'required_if'          => 'Поле :attribute обов\'язкове для заповнювання, коли :other дорівнює :value.',
	'required_unless'      => 'Поле :attribute обов\'язкове для заповнювання, коли :other не дорівнює  :values.',
	'required_with'        => 'Поле :attribute обов\'язкове для заповнювання, коли :values вказано.',
	'required_with_all'    => 'Поле :attribute обов\'язкове для заповнювання, коли :values вказано.',
	'required_without'     => 'Поле :attribute обов\'язкове для заповнювання, коли :values не вказано.',
	'required_without_all' => 'Поле :attribute обов\'язкове для заповнювання, коли жодне з :values не вказано.',
	'same'                 => 'Значення полів :attribute та :other повинні співпадати.',
	'size'                 => [
		'numeric' => 'Поле :attribute повинно дорівнювати :size.',
		'file'    => 'Розмір файлу в полі :attribute повинен дорівнювати :size Кілобайт(а).',
		'string'  => 'Кількість символів в полі :attribute повинна дорівнювати :size.',
		'array'   => 'Кількість елементів в полі :attribute повинна  дорівнявати :size.',
	],
	'starts_with'          => 'Поле :attribute повинно починатися з одного з наступних значень: :values',
	'string'               => 'Поле :attribute повинно бути рядком.',
	'timezone'             => 'Поле :attribute повинно бути дійсним часовим поясом.',
	'unique'               => 'Таке значення поля :attribute вже існує.',
	'uploaded'             => 'Завантаження поля :attribute не вдалося',
	'url'                  => 'Поле :attribute має помилковий формат.',
	'uuid'                 => 'Поле :attribute повинно бути коректним UUID.',

	/*
	|--------------------------------------------------------------------------
	| Власні мовні ресурси для перевірки значень
	|--------------------------------------------------------------------------
	|
	| Тут Ви маєте можливіть вказати власні повідомлення для атрибутів.
	| Це дозволяє легко вказати своє повідомлення для заданого правила атрибуту.
	|
	| http://laravel.com/docs/validation#custom-error-messages
	| Приклад використання
	|
	|   'custom' => [
	|       'email' => [
	|           'required' => 'Нам потрібно знати Вашу електронну адресу!',
	|       ],
	|   ],
	|
	*/
	'custom' => [
		'attribute-name' => [
			'rule-name' => 'custom-message',
		],
	],
	/*
	|--------------------------------------------------------------------------
	| Власні назви атрибутів
	|--------------------------------------------------------------------------
	|
	| Наступні рядки використовуються для підміни програмних імен елементів
	| інтерфейсу користувача на легкі для читання. Наприклад, замість ім'я
	| поля "email" в повідомленнях буде виводитися "электронна адреса".
	|
	| Приклад використання
	|
	|   'attributes' => [
	|       'email' => 'электронна адреса',
	|   ],
	|
	*/
	'attributes' => [
		'name'                  => 'Ім\'я',
		'username'              => 'Нікнейм',
		'email'                 => 'Електронна адреса',
		'first_name'            => 'Ім\'я',
		'last_name'             => 'Прізвище',
		'password'              => 'Пароль',
		'password_confirmation' => 'Підтвердження паролю',
		'city'                  => 'Місто',
		'country'               => 'Країна',
		'address'               => 'Адреса',
		'phone'                 => 'Телефон',
		'mobile'                => 'Моб. номер',
		'age'                   => 'Вік',
		'sex'                   => 'Стать',
		'gender'                => 'Стать',
		'day'                   => 'День',
		'month'                 => 'Місяць',
		'year'                  => 'Рік',
		'hour'                  => 'Година',
		'minute'                => 'Хвилина',
		'second'                => 'Секунда',
		'title'                 => 'Найменування',
		'content'               => 'Контент',
		'description'           => 'Опис',
		'excerpt'               => 'Уривок',
		'date'                  => 'Дата',
		'time'                  => 'Час',
		'available'             => 'Доступно',
		'size'                  => 'Розмір',
	],
];
